IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
PROCEDURE DIVISION.
    DISPLAY 'HELLO WORLD!'
    STOP RUN




>>SOURCE FORMAT FREE 
IDENTIFICATION DIVISION.
PROGRAM-ID. FILE10.
AUTHOR. HETAL PATEL.
DATE-WRITTEN.15TH SEPTEMBER 2020
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 UserName PIC X(30) VALUE "You".
01 Num1    PIC 9 VALUE ZEROES.
01 Num2    PIC 9 VALUE ZEROES.
01 TOTAL   PIC 99 VALUE 0.
01 SSNum.
       02 SSArea    PIC 999.
       02 SSGroup   PIC 99.
       02 SSSerial  PIC 9999.
01 PIValue CONSTANT AS 3.14.

LINKAGE SECTION.
PROCEDURE DIVISION.
DISPLAY "What is your name" WITH NO ADVANCING
ACCEPT UserName
DISPLAY "HELLO" UserName

STOP RUN.
